# core
tap "homebrew/core"
brew "ansible"
brew "anyenv"
brew "autoconf"
brew "automake"
brew "awscli"
brew "composer"
brew "curl"
brew "deployer"
brew "direnv"
brew "ffmpeg", args: ['HEAD']
brew "fontforge"
brew "fzy"
brew "gd"
brew "git"
brew "gnupg"
brew "go"
brew "gradle"
brew "jq"
brew "kotlin"
brew "lame"
brew "lftp"
brew "libxml2"
brew "mas"
brew "maven"
brew "mcrypt"
brew "mhash"
brew "mosh"
brew "mysql-utilities"
brew "nkf"
brew "openfortivpn"
brew "openssh"
brew "pup"
brew "rename"
brew "scala"
brew "sbt"
brew "terminal-notifier"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "yarn"
brew "zlib"
brew "zplug"
brew "zsh"

# cask
tap "homebrew/cask"
cask "alfred"
cask "apache-directory-studio"
cask "appcleaner"
cask "atom"
cask "dash"
cask "docker"
cask "dropbox"
cask "firefox"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-drive-file-stream"
cask "intellij-idea"
cask "iterm2"
cask "jad"
cask "java"
cask "mysqlworkbench"
cask "sequel-pro"
cask "skype"
cask "slack"
cask "sourcetree"
cask "toggl"
cask "vagrant"
cask "virtualbox"

# fonts
tap "homebrew/cask-fonts"
cask "font-coda"
cask "font-m-plus"
cask "font-noto-sans"
cask "font-noto-sans-cjk"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-source-code-pro"
cask "font-source-han-code-jp"

# atok
tap "shogogg/homebrew-cask-atok"
cask "atok-passport"

# mas
appstore 495987613   # File Viewer
appstore 539883307   # LINE
appstore 425424353   # The Unarchiver
appstore 1278508951  # Trello
appstore 485812721   # TweetDeck
