# core
brew "act"
brew "anyenv"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bat"
brew "bash"
brew "bzip2"
brew "composer"
brew "curl"
brew "direnv"
brew "emojify"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "flac"
brew "fontforge"
brew "fswatch"
brew "fujiwara/tap/aswrap"
brew "fzf"
brew "gd"
brew "gettext"
brew "gh"
brew "ghostty"
brew "ghq"
brew "git"
brew "git-delta"
brew "gnupg"
brew "go"
brew "go-task"
brew "gradle"
brew "graphviz"
brew "hexyl"
brew "httpie"
brew "hub"
brew "java"
brew "jq"
brew "jsonnet"
brew "kayac/tap/ecspresso"
brew "kotlin"
brew "less"
brew "libxml2"
brew "mas"
brew "mhash"
brew "mosh"
brew "mysql-client"
brew "nkf"
brew "node"
brew "oath-toolkit"
brew "openssh"
brew "phive"
brew "plantuml"
brew "php"
brew "psysh"
brew "pup"
brew "rename"
brew "rustup"
brew "sbt"
brew "scala"
brew "starship"
brew "subversion"
brew "telnet"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "yarn-completion"
brew "yq"
brew "zlib"
brew "zplug"
brew "zsh"

# cask
cask "alfred"
cask "appcleaner"
cask "atok"
#cask "authy"
cask "brave-browser"
#cask "discord"
cask "docker"
#cask "dropbox"
cask "firefox"
cask "gitup"
#cask "google-chrome"
#cask "google-drive"
cask "hot"
cask "iterm2"
cask "karabiner-elements"
#cask "keepassxc"
#cask "microsoft-excel"
#cask "microsoft-powerpoint"
#cask "microsoft-word"
#cask "microsoft-teams"
#cask "miro"
#cask "oracle-jdk"
#cask "session-manager-plugin"
#cask "slack"
#cask "toggl-track"
#cask "visual-studio-code"
cask "vivaldi"
#cask "zoom"

# fonts
cask "font-m-plus-1"
cask "font-m-plus-1-code"
cask "font-m-plus-1p"
cask "font-m-plus-2"
cask "font-noto-sans"
cask "font-noto-sans-cjk"
cask "font-plemol-jp"
cask "font-plemol-jp-nf"
cask "font-plemol-jp-hs"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"

# mas
#mas "Sequel Ace", id: 1518036000
#mas "Xcode", id: 497799835
