# core
tap "homebrew/core"
brew "act"
brew "android-sdk"
brew "ansible"
brew "anyenv"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bat"
brew "bash"
brew "bzip2"
brew "certbot"
brew "composer"
brew "curl"
brew "deployer"
brew "direnv"
brew "emojify"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "flac"
brew "fontforge"
brew "fzf"
brew "gd"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"
brew "gnupg"
brew "go"
brew "gradle"
brew "graphviz"
brew "hexyl"
brew "httpie"
brew "hub"
brew "java"
brew "jq"
brew "kotlin"
brew "lame"
brew "less"
brew "lftp"
brew "libxml2"
brew "lima"
brew "mas"
brew "maven"
brew "mcrypt"
brew "mhash"
brew "mosh"
brew "mysql-client"
brew "nkf"
brew "node"
brew "oath-toolkit"
brew "openfortivpn"
brew "openssh"
brew "phive"
brew "plantuml"
brew "php"
brew "pup"
brew "rename"
brew "rustup-init"
brew "sbt"
brew "scala"
brew "starship"
brew "subversion"
brew "telenet"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "yarn-completion"
brew "yq"
brew "zlib"
brew "zplug"
brew "zsh"

# cask
tap "homebrew/cask"
cask "1password-cli"
cask "alfred"
cask "android-platform-tools"
cask "appcleaner"
cask "atok"
cask "authy"
cask "boost-note"
cask "brave-browser"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "gitup"
cask "google-chrome"
cask "google-drive"
cask "hot"
cask "iterm2"
cask "karabiner-elements"
cask "keepassxc"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "microsoft-teams"
cask "miro"
cask "oracle-jdk"
cask "session-manager-plugin"
cask "slack"
cask "toggl-track"
cask "visual-studio-code"
cask "vivaldi"
cask "zoom"

# fonts
tap "homebrew/cask-fonts"
cask "font-mplus"
cask "font-mplus-nerd-font"
cask "font-noto-sans"
cask "font-noto-sans-cjk"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"

# mas
mas "Sequel Ace", id: 1518036000
mas "Xcode", id: 497799835
