# core
tap "homebrew/core"
brew "act"
brew "ansible"
brew "anyenv"
brew "autoconf"
brew "automake"
brew "awscli"
brew "certbot"
brew "composer"
brew "curl"
brew "deployer"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "emojify"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "flac"
brew "fontforge"
brew "fzf"
brew "gd"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"
brew "gnupg"
brew "go"
brew "gradle"
brew "hexyl"
brew "httpie"
brew "hub"
brew "jq"
brew "kotlin"
brew "lame"
brew "less"
brew "lftp"
brew "libxml2"
brew "lima"
brew "maven"
brew "mcrypt"
brew "mhash"
brew "mosh"
brew "mysql-client"
brew "nkf"
brew "node"
brew "oath-toolkit"
brew "openfortivpn"
brew "openssh"
brew "phive"
brew "php"
brew "phpbrew"
brew "pup"
brew "rename"
brew "sbt"
brew "scala"
brew "starship"
brew "svn"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "yarn-completion"
brew "zlib"
brew "zplug"
brew "zsh"

# cask
tap "homebrew/cask"
cask "1password-cli"
cask "alfred"
cask "android-platform-tools"
cask "appcleaner"
cask "atok"
cask "atom"
cask "authy"
cask "dropbox"
cask "firefox"
cask "gitup"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keepassx"
cask "miro"
cask "oracle-jdk"
cask "session-manager-plugin"
cask "slack"
cask "toggl-track"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"

# fonts
tap "homebrew/cask-fonts"
cask "font-coda"
cask "font-mplus"
cask "font-mplus-nerd-font"
cask "font-noto-sans"
cask "font-noto-sans-cjk"
cask "font-ricty-diminished"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "font-source-code-pro"
