# tap
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/binary'
tap 'homebrew/brewdler'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/versions'
tap 'shogogg/homebrew-cask-atok'

# for android
brew 'android-sdk'

# for php
brew 'zlib'
brew 'php55'
brew 'homebrew/php/composer'

# for scala
brew 'giter8'
brew 'sbt'
brew 'scala'
brew 'typesafe-activator'

# for Homebrew
brew 'brew-cask'

# for others
brew 'direnv'
brew 'ffmpeg'
brew 'fontforge'
brew 'git'
brew 'gnupg2'
brew 'jq'
brew 'lame'
brew 'lftp'
brew 'maven'
brew 'mobile-shell'
brew 'nkf'
brew 'peco'
brew 'phantomjs'
brew 'rename'
brew 'terminal-notifier'
brew 'tree'
brew 'wget'
brew 'zsh-completions'

# Cask
cask 'alfred'
cask 'apache-directory-studio'
cask 'atok-passport'
cask 'atom'
cask 'dash'
caks 'docker'
cask 'dropbox'
cask 'firefox-ja'
cask 'google-chrome'
cask 'google-drive'
cask 'intellij-idea'
cask 'iterm2'
cask 'java7'
cask 'libreoffice'
cask 'phpstorm'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'vagrant'
cask 'virtualbox'

# Cask (Fonts)
cask 'font-coda'
cask 'font-m-plus'
cask 'font-noto-sans'
cask 'font-noto-sans-cjk'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-source-code-pro'
cask 'font-source-han-code-jp'
