# core
tap "homebrew/core"
brew "ansible"
brew "autoconf"
brew "automake"
brew "awscli"
brew "curl"
brew "direnv"
brew "ffmpeg", args: ['with-fdk-aac', 'with-libass', 'with-webp', 'with-x265', 'with-freetype', 'with-libvorbis', 'with-libvpx', 'with-opus']
brew "fontforge"
brew "fzy"
brew "git"
brew "giter8"
brew "gnupg", link: false
brew "go"
brew "gpg-agent"
brew "gradle"
brew "jq"
brew "kotlin"
brew "lame"
brew "lftp"
brew "mas"
brew "maven"
brew "mosh"
brew "nkf"
brew "openssh"
brew "peco"
brew "phantomjs"
brew "pup"
brew "rename"
brew "scala"
brew "sbt"
brew "terminal-notifier"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "zlib"
brew "zplug"
brew "zsh"
brew "zsh-completions"

# php
tap "homebrew/php"
brew "composer"
brew "php-build"
brew "phpbrew"

# cask
tap "caskroom/cask"
cask "adobe-reader-ja"
cask "alfred"
cask "apache-directory-studio"
cask "appcleaner"
cask "atom"
cask "dash"
cask "docker"
cask "dropbox"
cask "firefox"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-drive-file-stream"
cask "intellij-idea"
cask "iterm2"
cask "jad"
cask "java7"
cask "karabiner"
cask "mysqlworkbench"
cask "sequel-pro"
cask "skype"
cask "slack"
cask "sourcetree"
cask "toggldesktop"
cask "vagrant"
cask "virtualbox"

# fonts
tap "caskroom/fonts"
cask "font-coda"
cask "font-m-plus"
cask "font-noto-sans"
cask "font-noto-sans-cjk"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-source-code-pro"
cask "font-source-han-code-jp"

# atok
tap "shogogg/homebrew-cask-atok"
cask "atok-passport"

# mas
mas "Cleaner for Memory", id: 748212890
mas "File Viewer", id: 495987613
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "The Unarchiver", id: 425424353
mas "Trello", id: 1278508951
mas "TweetDeck", id: 485812721
mas "YoruFukurou", id: 428834068
